male('Юрий Обыденков').
female('Наталья Харина').
female('Юлия Обыденкова').
male('Александр Харин').
female('Любовь Онищенко').
male('Виктор Обыденков').
female('Раиса Новикова').
female('Мария Волкова').
male('Владимир Онищенко').
female('Виктория Обыденкова').
female('Лариса Харина').
female('Акулина Новикова').
male('Федор Харин').
male('Игорь Никифоров').
male('Евгений Никифоров').
male('Александр Никифоров').
male('Артем Обыденков').
male('Алексей Обыденков').
female('Раиса Артемова').
male('Петр Новиков').
female('Галина Ямпольская').
parents('Юлия Обыденкова', 'Юрий Обыденков', 'Наталья Харина').
parents('Виктория Обыденкова', 'Юрий Обыденков', 'Наталья Харина').
parents('Лариса Харина', 'Александр Харин', 'Любовь Онищенко').
parents('Наталья Харина', 'Александр Харин', 'Любовь Онищенко').
parents('Юрий Обыденков', 'Виктор Обыденков', 'Раиса Новикова').
parents('Артем Обыденков', 'Виктор Обыденков', 'Раиса Новикова').
parents('Любовь Онищенко', 'Владимир Онищенко', 'Мария Волкова').
parents('Александр Харин', 'Федор Харин', 'Акулина Новикова').
parents('Евгений Никифоров', 'Игорь Никифоров', 'Лариса Харина').
parents('Александр Никифоров', 'Игорь Никифоров', 'Лариса Харина').
parents('Виктор Обыденков', 'Алексей Обыденков', 'Раиса Артемова').
parents('Раиса Новикова', 'Петр Новиков', 'Галина Ямпольская').
